cfd-simulation/eel/U_0p2/0/U
FoamFile
{
    version 2.0;
    format ascii;
    class volVectorField;
    object U;
}

dimensions [0 1 -1 0 0 0 0];

internalField uniform ( 0.2 0 0 );

boundaryField
{
    inlet
    {
        type fixedValue;
        value uniform ( 0.2 0 0 );
    }

    outlet
    {
        type zeroGradient;
    }

    bottom
    {
        type symmetry;
    }

    top
    {
        type symmetry;
    }

    sideMin
    {
        type symmetry;
    }

    sideMax
    {
        type symmetry;
    }

    fish
    {
        type noSlip;
    }
}
